app/controllers/records_controller.rb

SELECT * FROM "records"
---
  def index
    @records = Record.all

SELECT * FROM "records" WHERE ("records"."id" = 1)
---
  def show
    @record = Record.find(params[:id])

SELECT * FROM "records" WHERE ("records"."id" = 1)
---
  def edit
    @record = Record.find(params[:id])

SELECT * FROM "artists" WHERE ("artists"."name" = 'Beatles') LIMIT 1
INSERT INTO "records" ("name", "multiple_units", "speed_id", "created_at", "updated_at", "catalog_number", "artist_id") VALUES('Fragile', 'f', 0, '2009-05-18 06:08:08', '2009-05-18 06:08:08', 'SD19132', 0)
---
  def create
    @params = params[:record]

    @artist = Artist.find_or_create_by_name('Beatles')

    @record = Record.new( :name => @params[ :name ], :artist_id => @artist.id, :speed_id => @params[ :speed_id ], :multiple_units => @params[ :multiple_units ], :catalog_number => @params[ :catalog_number ] )

    respond_to do |format|
      if @record.save