app/controllers/speeds_controller.rb

  def index
    @speeds = Speed.all
---
SELECT * FROM "speeds"

  def show
    @speed = Speed.find(params[:id])
---
SELECT * FROM "speeds" WHERE ("speeds"."id" = 1)

  def edit
    @speed = Speed.find(params[:id])
---
SELECT * FROM "speeds" WHERE ("speeds"."id" = 1)

  def create
    @speed = Speed.new(params[:speed])

    respond_to do |format|
      if @speed.save
---
INSERT INTO "speeds" ("name", "created_at", "updated_at") VALUES('33', '2009-05-18 05:04:14', '2009-05-18 05:04:14')

  def update
    @speed = Speed.find(params[:id])

    respond_to do |format|
      if @speed.update_attributes(params[:speed])
---
SELECT * FROM "speeds" WHERE ("speeds"."id" = 1)
UPDATE "speeds" SET "updated_at" = '2009-05-19 04:18:26', "name" = '33 1/3' WHERE "id" = 1